7767517
57 65
Input                    input0                   0 1 input0 0=224 1=224 2=3 -23328=1,1126530694 -23329=1,60.478107
Convolution              Conv_0                   1 1 input0 input.4 0=64 1=7 3=2 4=3 5=1 6=9408 20=1 21=306 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,213.683533
ReLU                     Relu_1                   1 1 input.4 onnx::MaxPool_125 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,213.683533
Pooling                  MaxPool_2                1 1 onnx::MaxPool_125 input.8 1=3 2=2 3=1 5=1 20=1 21=32767 22=15 -23328=1,1 -23329=1,213.683533
Split                    splitncnn_0              1 2 input.8 input.8_splitncnn_0 input.8_splitncnn_1 -23328=1,1 -23329=2,213.683533,213.683533
Convolution              Conv_3                   1 1 input.8_splitncnn_1 input.16 0=64 1=3 4=1 5=1 6=36864 20=1 21=125 22=15 23=0 24=2 25=1 26=21165 27=13 -23328=1,1 -23329=1,254.395401
ReLU                     Relu_4                   1 1 input.16 onnx::Conv_129 20=1 21=17860 22=14 23=1 -23328=1,1 -23329=1,277.309479
Convolution              Conv_5                   1 1 onnx::Conv_129 onnx::Add_198 0=64 1=3 4=1 5=1 6=36864 20=1 21=96 22=15 23=0 24=2 25=1 26=19599 27=13 -23328=1,1 -23329=1,128.863815
Eltwise                  Add_6                    2 1 onnx::Add_198 input.8_splitncnn_0 onnx::Relu_132 0=1 20=1 21=19035 22=15 17=27168 18=14 -23328=1,1 -23329=1,124.134201
ReLU                     Relu_7                   1 1 onnx::Relu_132 input.24 20=1 21=32685 22=15 23=1 -23328=1,1 -23329=1,123.822891
Split                    splitncnn_1              1 2 input.24 input.24_splitncnn_0 input.24_splitncnn_1 -23328=1,1 -23329=2,123.822891,123.822891
Convolution              Conv_8                   1 1 input.24_splitncnn_1 input.32 0=64 1=3 4=1 5=1 6=36864 20=1 21=165 22=15 23=0 24=2 25=1 26=17708 27=13 -23328=1,1 -23329=1,309.463928
ReLU                     Relu_9                   1 1 input.32 onnx::Conv_136 20=1 21=18180 22=14 23=1 -23328=1,1 -23329=1,343.386536
Convolution              Conv_10                  1 1 onnx::Conv_136 onnx::Add_204 0=64 1=3 4=1 5=1 6=36864 20=1 21=120 22=15 23=0 24=2 25=1 26=25850 27=14 -23328=1,1 -23329=1,164.952682
Eltwise                  Add_11                   2 1 onnx::Add_204 input.24_splitncnn_0 onnx::Relu_139 0=1 20=1 21=15649 22=15 17=21826 18=14 16=1 -23328=1,1 -23329=1,78.777321
ReLU                     Relu_12                  1 1 onnx::Relu_139 input.40 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,78.777321
Split                    splitncnn_2              1 2 input.40 input.40_splitncnn_0 input.40_splitncnn_1 -23328=1,1 -23329=2,78.777321,78.777321
Convolution              Conv_13                  1 1 input.40_splitncnn_1 input.48 0=128 1=3 3=2 4=1 5=1 6=73728 20=1 21=145 22=15 23=0 24=2 25=1 26=17656 27=14 -23328=1,1 -23329=1,213.888748
ReLU                     Relu_14                  1 1 input.48 onnx::Conv_143 20=1 21=16414 22=14 23=1 -23328=1,1 -23329=1,214.280304
Convolution              Conv_15                  1 1 onnx::Conv_143 onnx::Add_210 0=128 1=3 4=1 5=1 6=147456 20=1 21=163 22=15 23=0 24=2 25=1 26=25682 27=14 -23328=1,1 -23329=1,172.855667
Convolution              Conv_16                  1 1 input.40_splitncnn_0 onnx::Add_213 0=128 1=1 3=2 5=1 6=8192 20=1 21=606 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,271.257874
Eltwise                  Add_17                   2 1 onnx::Add_210 onnx::Add_213 onnx::Relu_148 0=1 20=1 21=14824 22=15 17=25711 18=14 -23328=1,1 -23329=1,122.718178
ReLU                     Relu_18                  1 1 onnx::Relu_148 input.60 20=1 21=24779 22=14 23=1 -23328=1,1 -23329=1,185.594559
Split                    splitncnn_3              1 2 input.60 input.60_splitncnn_0 input.60_splitncnn_1 -23328=1,1 -23329=2,185.594559,185.594559
Convolution              Conv_19                  1 1 input.60_splitncnn_1 input.68 0=128 1=3 4=1 5=1 6=147456 20=1 21=58 22=15 23=0 24=2 25=1 26=29874 27=14 -23328=1,1 -23329=1,124.418083
ReLU                     Relu_20                  1 1 input.68 onnx::Conv_152 20=1 21=26248 22=14 23=1 -23328=1,1 -23329=1,199.327225
Convolution              Conv_21                  1 1 onnx::Conv_152 onnx::Add_219 0=128 1=3 4=1 5=1 6=147456 20=1 21=138 22=15 23=0 24=2 25=1 26=17170 27=14 -23328=1,1 -23329=1,126.711342
Eltwise                  Add_22                   2 1 onnx::Add_219 input.60_splitncnn_0 onnx::Relu_155 0=1 20=1 21=19230 22=15 17=23998 18=14 -23328=1,1 -23329=1,108.920570
ReLU                     Relu_23                  1 1 onnx::Relu_155 input.76 20=1 21=17553 22=14 23=1 -23328=1,1 -23329=1,116.691666
Split                    splitncnn_4              1 2 input.76 input.76_splitncnn_0 input.76_splitncnn_1 -23328=1,1 -23329=2,116.691666,116.691666
Convolution              Conv_24                  1 1 input.76_splitncnn_1 input.84 0=256 1=3 3=2 4=1 5=1 6=294912 20=1 21=57 22=15 23=0 24=2 25=1 26=26789 27=14 -23328=1,1 -23329=1,106.090652
ReLU                     Relu_25                  1 1 input.84 onnx::Conv_159 20=1 21=32695 22=15 23=1 -23328=1,1 -23329=1,105.857613
Convolution              Conv_26                  1 1 onnx::Conv_159 onnx::Add_225 0=256 1=3 4=1 5=1 6=589824 20=1 21=109 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,82.308716
Convolution              Conv_27                  1 1 input.76_splitncnn_0 onnx::Add_228 0=256 1=1 3=2 5=1 6=32768 20=1 21=249 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,250.405090
Eltwise                  Add_28                   2 1 onnx::Add_225 onnx::Add_228 onnx::Relu_164 0=1 20=1 21=8375 22=15 17=24922 18=13 -23328=1,1 -23329=1,64.001190
ReLU                     Relu_29                  1 1 onnx::Relu_164 input.96 20=1 21=21270 22=14 23=1 -23328=1,1 -23329=1,83.085991
Split                    splitncnn_5              1 2 input.96 input.96_splitncnn_0 input.96_splitncnn_1 -23328=1,1 -23329=2,83.085991,83.085991
Convolution              Conv_30                  1 1 input.96_splitncnn_1 input.104 0=256 1=3 4=1 5=1 6=589824 20=1 21=70 22=15 23=0 24=2 25=1 26=18464 27=14 -23328=1,1 -23329=1,76.014793
ReLU                     Relu_31                  1 1 input.104 onnx::Conv_168 20=1 21=31526 22=15 23=1 -23328=1,1 -23329=1,73.136009
Convolution              Conv_32                  1 1 onnx::Conv_168 onnx::Add_234 0=256 1=3 4=1 5=1 6=589824 20=1 21=101 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,29.653790
Eltwise                  Add_33                   2 1 onnx::Add_234 input.96_splitncnn_0 onnx::Relu_171 0=1 20=1 21=15793 22=15 17=22953 18=13 -23328=1,1 -23329=1,40.045151
ReLU                     Relu_34                  1 1 onnx::Relu_171 input.112 20=1 21=23833 22=14 23=1 -23328=1,1 -23329=1,58.252838
Split                    splitncnn_6              1 2 input.112 input.112_splitncnn_0 input.112_splitncnn_1 -23328=1,1 -23329=2,58.252838,58.252838
Convolution              Conv_35                  1 1 input.112_splitncnn_1 input.120 0=512 1=3 3=2 4=1 5=1 6=1179648 20=1 21=109 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,89.723465
ReLU                     Relu_36                  1 1 input.120 onnx::Conv_175 20=1 21=19948 22=14 23=1 -23328=1,1 -23329=1,109.238571
Convolution              Conv_37                  1 1 onnx::Conv_175 onnx::Add_240 0=512 1=3 4=1 5=1 6=2359296 20=1 21=114 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,45.332550
Convolution              Conv_38                  1 1 input.112_splitncnn_0 onnx::Add_243 0=512 1=1 3=2 5=1 6=131072 20=1 21=227 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,55.441360
Eltwise                  Add_39                   2 1 onnx::Add_240 onnx::Add_243 onnx::Relu_180 0=1 20=1 21=26067 22=15 17=20038 18=14 -23328=1,1 -23329=1,44.105392
ReLU                     Relu_40                  1 1 onnx::Relu_180 input.132 20=1 21=26023 22=14 23=1 -23328=1,1 -23329=1,70.052490
Split                    splitncnn_7              1 2 input.132 input.132_splitncnn_0 input.132_splitncnn_1 -23328=1,1 -23329=2,70.052490,70.052490
Convolution              Conv_41                  1 1 input.132_splitncnn_1 input.140 0=512 1=3 4=1 5=1 6=2359296 20=1 21=68 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,62.105686
ReLU                     Relu_42                  1 1 input.140 onnx::Conv_184 20=1 21=28455 22=13 23=1 -23328=1,1 -23329=1,215.725922
Convolution              Conv_43                  1 1 onnx::Conv_184 onnx::Add_249 0=512 1=3 4=1 5=1 6=2359296 20=1 21=140 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,25.809938
Eltwise                  Add_44                   2 1 onnx::Add_249 input.132_splitncnn_0 onnx::Relu_187 0=1 20=1 21=10753 22=15 17=22234 18=13 -23328=1,1 -23329=1,22.987770
ReLU                     Relu_45                  1 1 onnx::Relu_187 input.148 20=1 21=32679 22=15 23=1 -23328=1,1 -23329=1,22.925961
Pooling                  GlobalAveragePool_46     1 1 input.148 onnx::Gemm_190 0=1 4=1 20=1 21=24152 22=13 -23328=1,1 -23329=1,67.591805
InnerProduct             Gemm_48                  1 1 onnx::Gemm_190 output0 0=2 1=1 2=1024 20=1 21=38 22=15 24=2 25=1 -23328=1,1 -23329=1,139.693893
