7767517
57 65
Input                    input0                   0 1 input0 0=224 1=224 2=3 -23328=1,1126794757 -23329=1,60.478107
Convolution              Conv_0                   1 1 input0 input.4 0=64 1=7 3=2 4=3 5=1 6=9408 20=1 21=125 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,107.261719
ReLU                     Relu_1                   1 1 input.4 onnx::MaxPool_125 20=1 21=16585 22=13 23=1 -23328=1,1 -23329=1,217.154068
Pooling                  MaxPool_2                1 1 onnx::MaxPool_125 input.8 1=3 2=2 3=1 5=1 20=1 21=32767 22=15 -23328=1,1 -23329=1,217.154068
Split                    splitncnn_0              1 2 input.8 input.8_splitncnn_0 input.8_splitncnn_1 -23328=1,1 -23329=2,217.154068,217.154068
Convolution              Conv_3                   1 1 input.8_splitncnn_1 input.16 0=64 1=3 4=1 5=1 6=36864 20=1 21=110 22=15 23=0 24=2 25=1 26=22894 27=13 -23328=1,1 -23329=1,244.461807
ReLU                     Relu_4                   1 1 input.16 onnx::Conv_129 20=1 21=32403 22=15 23=1 -23328=1,1 -23329=1,241.744934
Convolution              Conv_5                   1 1 onnx::Conv_129 onnx::Add_198 0=64 1=3 4=1 5=1 6=36864 20=1 21=92 22=15 23=0 24=2 25=1 26=17531 27=13 -23328=1,1 -23329=1,112.182365
Eltwise                  Add_6                    2 1 onnx::Add_198 input.8_splitncnn_0 onnx::Relu_132 0=1 20=1 21=16252 22=15 17=31715 18=14 -23328=1,1 -23329=1,107.704910
ReLU                     Relu_7                   1 1 onnx::Relu_132 input.24 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,107.704910
Split                    splitncnn_1              1 2 input.24 input.24_splitncnn_0 input.24_splitncnn_1 -23328=1,1 -23329=2,107.704910,107.704910
Convolution              Conv_8                   1 1 input.24_splitncnn_1 input.32 0=64 1=3 4=1 5=1 6=36864 20=1 21=119 22=15 23=0 24=2 25=1 26=17622 27=13 -23328=1,1 -23329=1,216.242752
ReLU                     Relu_9                   1 1 input.32 onnx::Conv_136 20=1 21=24114 22=14 23=1 -23328=1,1 -23329=1,318.271301
Convolution              Conv_10                  1 1 onnx::Conv_136 onnx::Add_204 0=64 1=3 4=1 5=1 6=36864 20=1 21=106 22=15 23=0 24=2 25=1 26=28651 27=14 -23328=1,1 -23329=1,143.173340
Eltwise                  Add_11                   2 1 onnx::Add_204 input.24_splitncnn_0 onnx::Relu_139 0=1 20=1 21=17153 22=15 17=21779 18=14 16=1 -23328=1,1 -23329=1,74.948692
ReLU                     Relu_12                  1 1 onnx::Relu_139 input.40 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,74.948692
Split                    splitncnn_2              1 2 input.40 input.40_splitncnn_0 input.40_splitncnn_1 -23328=1,1 -23329=2,74.948692,74.948692
Convolution              Conv_13                  1 1 input.40_splitncnn_1 input.48 0=128 1=3 3=2 4=1 5=1 6=73728 20=1 21=146 22=15 23=0 24=2 25=1 26=17553 27=14 -23328=1,1 -23329=1,211.352036
ReLU                     Relu_14                  1 1 input.48 onnx::Conv_143 20=1 21=30276 22=15 23=1 -23328=1,1 -23329=1,195.285736
Convolution              Conv_15                  1 1 onnx::Conv_143 onnx::Add_210 0=128 1=3 4=1 5=1 6=147456 20=1 21=144 22=15 23=0 24=2 25=1 26=26140 27=14 -23328=1,1 -23329=1,141.694565
Convolution              Conv_16                  1 1 input.40_splitncnn_0 onnx::Add_213 0=128 1=1 3=2 5=1 6=8192 20=1 21=475 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,207.850128
Eltwise                  Add_17                   2 1 onnx::Add_210 onnx::Add_213 onnx::Relu_148 0=1 20=1 21=21088 22=15 17=24034 18=14 -23328=1,1 -23329=1,133.766708
ReLU                     Relu_18                  1 1 onnx::Relu_148 input.60 20=1 21=20351 22=14 23=1 -23328=1,1 -23329=1,166.158661
Split                    splitncnn_3              1 2 input.60 input.60_splitncnn_0 input.60_splitncnn_1 -23328=1,1 -23329=2,166.158661,166.158661
Convolution              Conv_19                  1 1 input.60_splitncnn_1 input.68 0=128 1=3 4=1 5=1 6=147456 20=1 21=66 22=15 23=0 24=2 25=1 26=29227 27=14 -23328=1,1 -23329=1,134.875122
ReLU                     Relu_20                  1 1 input.68 onnx::Conv_152 20=1 21=23901 22=14 23=1 -23328=1,1 -23329=1,196.755859
Convolution              Conv_21                  1 1 onnx::Conv_152 onnx::Add_219 0=128 1=3 4=1 5=1 6=147456 20=1 21=137 22=15 23=0 24=2 25=1 26=19344 27=14 -23328=1,1 -23329=1,125.328239
Eltwise                  Add_22                   2 1 onnx::Add_219 input.60_splitncnn_0 onnx::Relu_155 0=1 20=1 21=22641 22=15 17=21722 18=14 -23328=1,1 -23329=1,114.812088
ReLU                     Relu_23                  1 1 onnx::Relu_155 input.76 20=1 21=32689 22=15 23=1 -23328=1,1 -23329=1,114.538406
Split                    splitncnn_4              1 2 input.76 input.76_splitncnn_0 input.76_splitncnn_1 -23328=1,1 -23329=2,114.538406,114.538406
Convolution              Conv_24                  1 1 input.76_splitncnn_1 input.84 0=256 1=3 3=2 4=1 5=1 6=294912 20=1 21=58 22=15 23=0 24=2 25=1 26=26047 27=14 -23328=1,1 -23329=1,102.701454
ReLU                     Relu_25                  1 1 input.84 onnx::Conv_159 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,102.701454
Convolution              Conv_26                  1 1 onnx::Conv_159 onnx::Add_225 0=256 1=3 4=1 5=1 6=589824 20=1 21=101 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,74.660210
Convolution              Conv_27                  1 1 input.76_splitncnn_0 onnx::Add_228 0=256 1=1 3=2 5=1 6=32768 20=1 21=244 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,243.100845
Eltwise                  Add_28                   2 1 onnx::Add_225 onnx::Add_228 onnx::Relu_164 0=1 20=1 21=10209 22=15 17=26674 18=13 -23328=1,1 -23329=1,75.739151
ReLU                     Relu_29                  1 1 onnx::Relu_164 input.96 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,75.739151
Split                    splitncnn_5              1 2 input.96 input.96_splitncnn_0 input.96_splitncnn_1 -23328=1,1 -23329=2,75.739151,75.739151
Convolution              Conv_30                  1 1 input.96_splitncnn_1 input.104 0=256 1=3 4=1 5=1 6=589824 20=1 21=34 22=15 23=0 24=2 25=1 26=17923 27=14 -23328=1,1 -23329=1,33.394764
ReLU                     Relu_31                  1 1 input.104 onnx::Conv_168 20=1 21=28692 22=14 23=1 -23328=1,1 -23329=1,58.480991
Convolution              Conv_32                  1 1 onnx::Conv_168 onnx::Add_234 0=256 1=3 4=1 5=1 6=589824 20=1 21=87 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,20.109344
Eltwise                  Add_33                   2 1 onnx::Add_234 input.96_splitncnn_0 onnx::Relu_171 0=1 20=1 21=8598 22=15 17=30854 18=13 -23328=1,1 -23329=1,19.873543
ReLU                     Relu_34                  1 1 onnx::Relu_171 input.112 20=1 21=27024 22=14 23=1 -23328=1,1 -23329=1,32.779430
Split                    splitncnn_6              1 2 input.112 input.112_splitncnn_0 input.112_splitncnn_1 -23328=1,1 -23329=2,32.779430,32.779430
Convolution              Conv_35                  1 1 input.112_splitncnn_1 input.120 0=512 1=3 3=2 4=1 5=1 6=1179648 20=1 21=125 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,57.088032
ReLU                     Relu_36                  1 1 input.120 onnx::Conv_175 20=1 21=16394 22=14 23=1 -23328=1,1 -23329=1,57.122932
Convolution              Conv_37                  1 1 onnx::Conv_175 onnx::Add_240 0=512 1=3 4=1 5=1 6=2359296 20=1 21=135 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,27.424255
Convolution              Conv_38                  1 1 input.112_splitncnn_0 onnx::Add_243 0=512 1=1 3=2 5=1 6=131072 20=1 21=275 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,37.143620
Eltwise                  Add_39                   2 1 onnx::Add_240 onnx::Add_243 onnx::Relu_180 0=1 20=1 21=22160 22=15 17=22191 18=14 -23328=1,1 -23329=1,25.120153
ReLU                     Relu_40                  1 1 onnx::Relu_180 input.132 20=1 21=17852 22=13 23=1 -23328=1,1 -23329=1,54.742928
Split                    splitncnn_7              1 2 input.132 input.132_splitncnn_0 input.132_splitncnn_1 -23328=1,1 -23329=2,54.742928,54.742928
Convolution              Conv_41                  1 1 input.132_splitncnn_1 input.140 0=512 1=3 4=1 5=1 6=2359296 20=1 21=73 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,49.017021
ReLU                     Relu_42                  1 1 input.140 onnx::Conv_184 20=1 21=20344 22=12 23=1 -23328=1,1 -23329=1,243.454834
Convolution              Conv_43                  1 1 onnx::Conv_184 onnx::Add_249 0=512 1=3 4=1 5=1 6=2359296 20=1 21=110 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,21.931530
Eltwise                  Add_44                   2 1 onnx::Add_249 input.132_splitncnn_0 onnx::Relu_187 0=1 20=1 21=11387 22=15 17=20448 18=13 -23328=1,1 -23329=1,19.023251
ReLU                     Relu_45                  1 1 onnx::Relu_187 input.148 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,19.023251
Pooling                  GlobalAveragePool_46     1 1 input.148 onnx::Gemm_190 0=1 4=1 20=1 21=18279 22=12 -23328=1,1 -23329=1,84.894447
InnerProduct             Gemm_48                  1 1 onnx::Gemm_190 output0 0=2 1=1 2=1024 20=1 21=261 22=15 24=2 25=1 -23328=1,1 -23329=1,1057.437866
